[

        {
            "categoryName": "Avengers",
            "picture": "https://images.unsplash.com/photo-1608889476518-738c9b1dcb40?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=580&q=80",
            "name": "Iron Man Action Figure",
            "price": 29.99,
            "rating": 4.5,
            "availableQuantity": 10,
            "description": "Unleash the power of Iron Man with this highly detailed action figure. Standing at 6 inches tall, this figure features incredible articulation and comes with a range of accessories, including interchangeable hands and repulsor blast effects. Whether you're a collector or a fan, this Iron Man action figure is a must-have addition to your Avengers collection. With its striking red and gold armor, it perfectly captures the iconic look of Tony Stark's superhero alter ego. Display it on your shelf or recreate epic battle scenes. Get ready to join the Avengers and save the world from threats with this Iron Man action figure."
        },
        {
            "categoryName": "Avengers",
            "picture": "https://i.ibb.co/sWMsTW9/Thor-Hammer.jpg",
            "name": "Thor Hammer",
            "price": 24.99,
            "rating": 4.3,
            "availableQuantity": 8,
            "description": "Wield the power of Thor with this incredible replica of Mjolnir, the mighty hammer of the God of Thunder. Crafted with attention to detail, this hammer features intricate engravings and a weathered finish. Feel the weight and power in your hands as you swing the hammer, just like Thor himself. Whether you're a fan of the comics or the movies, this Thor Hammer replica is a fantastic addition to your Avengers collection. Use it for cosplay, display it on your shelf, or simply marvel at its craftsmanship. Become a true Avenger and embrace the power of thunder with this stunning Thor Hammer."
        }
    ,

        {
            "categoryName": "Star wars",
            "picture": "https://i.ibb.co/2gQXhqC/Luke-Skywalker-Action-Figure.png",
            "name": "Luke Skywalker Action Figure",
            "price": 29.99,
            "rating": 4.5,
            "availableQuantity": 15,
            "description": "Embark on an intergalactic adventure with this highly detailed Luke Skywalker action figure. Standing at 6 inches tall, this figure captures the essence of the iconic Jedi Knight from the Star Wars universe. With his lightsaber in hand, Luke Skywalker is ready to face the forces of evil and restore peace to the galaxy. The figure features multiple points of articulation, allowing you to pose Luke Skywalker in various action-packed stances. Whether you're a collector or a fan of the Star Wars franchise, this action figure is a must-have addition to your collection. Display it proudly on your shelf or engage in epic lightsaber duels with other Star Wars figures. May the Force be with you!"
        },
        {
            "categoryName": "Star wars",
            "picture": "https://i.ibb.co/dfQ6bxg/Darth-Vader-Helmet-Replica.jpg",
            "name": "Darth Vader Helmet Replica",
            "price": 59.99,
            "rating": 4.7,
            "availableQuantity": 10,
            "description": "Channel the power of the Dark Side with this impressive Darth Vader helmet replica. Faithfully recreated from the original movie design, this helmet is a must-have for any Star Wars enthusiast. Made from high-quality materials, this replica features intricate detailing and a glossy black finish. Put on the helmet and immerse yourself in the role of the infamous Sith Lord. Feel the weight of the Dark Side as you command the forces of the Galactic Empire. Whether you're a collector or preparing for a cosplay event, this Darth Vader helmet replica will make a bold statement. Display it as a centerpiece in your collection or wear it to become the ultimate Sith Lord. Unleash your inner Darth Vader and embrace the power of the Dark Side!"
        }
    ,

        {
            "categoryName": "transformers",
            "picture": "https://i.ibb.co/PN6KNp1/Optimus-Prime-Action-Figure.jpg",
            "name": "Optimus Prime Action Figure",
            "price": 39.99,
            "rating": 4.6,
            "availableQuantity": 12,
            "description": "Unleash the power of the Autobots with this highly detailed Optimus Prime action figure. Standing at 8 inches tall, this figure features intricate design and articulation, allowing you to recreate epic battles between the Autobots and Decepticons. Transform Optimus Prime from his robot mode to a powerful semi-truck and back. With his iconic red and blue armor, Optimus Prime is the fearless leader of the Autobots and a symbol of heroism. Display him proudly on your shelf or engage in hours of imaginative play. Join the Transformers universe and protect the Earth from the forces of evil with this incredible Optimus Prime action figure."
        },
        {
            "categoryName": "transformers",
            "picture": "https://i.ibb.co/NWzzD4J/umblebee-Camaro.jpg",
            "name": "Bumblebee Camaro",
            "price": 29.99,
            "rating": 4.8,
            "availableQuantity": 7,
            "description": "Get ready for high-speed action with this Bumblebee Camaro toy. Inspired by the Transformers movies, this sleek and stylish Camaro vehicle can transform into the beloved Autobot, Bumblebee. With its vibrant yellow color and black racing stripes, this Bumblebee Camaro is a true showstopper. Cruise the streets in style or engage in thrilling Transformers battles. The transformation is simple and intuitive, allowing you to switch between vehicle and robot mode with ease. Join forces with the Autobots and fight against the Decepticons to protect humanity. Whether you're a collector or a fan of the Transformers franchise, this Bumblebee Camaro is a must-have addition to your collection."
        }

]